'''
1.编写程序，找出并按从小到大顺序输出n以内（n<10000,包含n）的所有素数。输出时，每5个素数一行，每个数占5位宽，左对齐。
【注意】运行效果应如下所示，格式错误算结果错误。
测试1：（第1行为输入，其余行为输出）
100
2    3    5    7    11   
13   17   19   23   29   
31   37   41   43   47   
53   59   61   67   71   
73   79   83   89   97  

'''
n = int(input())
t = 0
for num in range(2, n+1):
    for i in range(2, num):
        if num % i == 0:
            break
    else:
        t += 1
        print(format(num, '<10'), end='')
        if t % 10 == 0:
            print()
